mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/common/s6e2dfxj.h
/*******************************************************************************
* I2SPRE_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t ICCR;
        stc_i2spre_iccr_field_t ICCR_f;
        struct {
          union {
            __IO uint16_t ICCRL;
            struct {
              __IO uint8_t ICCRLL;
              __IO uint8_t ICCRLH;
            };
          };
          union {
            __IO uint16_t ICCRH;
            struct {
              __IO uint8_t ICCRHL;
              __IO uint8_t ICCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR1;
        stc_i2spre_ipcr1_field_t IPCR1_f;
        struct {
          union {
            __IO uint16_t IPCR1L;
            struct {
              __IO uint8_t IPCR1LL;
              __IO uint8_t IPCR1LH;
            };
          };
          union {
            __IO uint16_t IPCR1H;
            struct {
              __IO uint8_t IPCR1HL;
              __IO uint8_t IPCR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR2;
        stc_i2spre_ipcr2_field_t IPCR2_f;
        struct {
          union {
            __IO uint16_t IPCR2L;
            struct {
              __IO uint8_t IPCR2LL;
              __IO uint8_t IPCR2LH;
            };
          };
          union {
            __IO uint16_t IPCR2H;
            struct {
              __IO uint8_t IPCR2HL;
              __IO uint8_t IPCR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR3;
        stc_i2spre_ipcr3_field_t IPCR3_f;
        struct {
          union {
            __IO uint16_t IPCR3L;
            struct {
              __IO uint8_t IPCR3LL;
              __IO uint8_t IPCR3LH;
            };
          };
          union {
            __IO uint16_t IPCR3H;
            struct {
              __IO uint8_t IPCR3HL;
              __IO uint8_t IPCR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR4;
        stc_i2spre_ipcr4_field_t IPCR4_f;
        struct {
          union {
            __IO uint16_t IPCR4L;
            struct {
              __IO uint8_t IPCR4LL;
              __IO uint8_t IPCR4LH;
            };
          };
          union {
            __IO uint16_t IPCR4H;
            struct {
              __IO uint8_t IPCR4HL;
              __IO uint8_t IPCR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IP_STR;
        stc_i2spre_ip_str_field_t IP_STR_f;
        struct {
          union {
            __IO uint16_t IP_STRL;
            struct {
              __IO uint8_t IP_STRLL;
              __IO uint8_t IP_STRLH;
            };
          };
          union {
            __IO uint16_t IP_STRH;
            struct {
              __IO uint8_t IP_STRHL;
              __IO uint8_t IP_STRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_ENR;
        stc_i2spre_ipint_enr_field_t IPINT_ENR_f;
        struct {
          union {
            __IO uint16_t IPINT_ENRL;
            struct {
              __IO uint8_t IPINT_ENRLL;
              __IO uint8_t IPINT_ENRLH;
            };
          };
          union {
            __IO uint16_t IPINT_ENRH;
            struct {
              __IO uint8_t IPINT_ENRHL;
              __IO uint8_t IPINT_ENRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_CLR;
        stc_i2spre_ipint_clr_field_t IPINT_CLR_f;
        struct {
          union {
            __IO uint16_t IPINT_CLRL;
            struct {
              __IO uint8_t IPINT_CLRLL;
              __IO uint8_t IPINT_CLRLH;
            };
          };
          union {
            __IO uint16_t IPINT_CLRH;
            struct {
              __IO uint8_t IPINT_CLRHL;
              __IO uint8_t IPINT_CLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_STR;
        stc_i2spre_ipint_str_field_t IPINT_STR_f;
        struct {
          union {
            __IO uint16_t IPINT_STRL;
            struct {
              __IO uint8_t IPINT_STRLL;
              __IO uint8_t IPINT_STRLH;
            };
          };
          union {
            __IO uint16_t IPINT_STRH;
            struct {
              __IO uint8_t IPINT_STRHL;
              __IO uint8_t IPINT_STRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR5;
        stc_i2spre_ipcr5_field_t IPCR5_f;
        struct {
          union {
            __IO uint16_t IPCR5L;
            struct {
              __IO uint8_t IPCR5LL;
              __IO uint8_t IPCR5LH;
            };
          };
          union {
            __IO uint16_t IPCR5H;
            struct {
              __IO uint8_t IPCR5HL;
              __IO uint8_t IPCR5HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[8];
    union {
        __IO uint32_t ICCR_1;
        stc_i2spre_iccr_1_field_t ICCR_1_f;
        struct {
          union {
            __IO uint16_t ICCR_1L;
            struct {
              __IO uint8_t ICCR_1LL;
              __IO uint8_t ICCR_1LH;
            };
          };
          union {
            __IO uint16_t ICCR_1H;
            struct {
              __IO uint8_t ICCR_1HL;
              __IO uint8_t ICCR_1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR5_1;
        stc_i2spre_ipcr5_1_field_t IPCR5_1_f;
        struct {
          union {
            __IO uint16_t IPCR5_1L;
            struct {
              __IO uint8_t IPCR5_1LL;
              __IO uint8_t IPCR5_1LH;
            };
          };
          union {
            __IO uint16_t IPCR5_1H;
            struct {
              __IO uint8_t IPCR5_1HL;
              __IO uint8_t IPCR5_1HH;
            };
          };
        };
    };
} FM_I2SPRE_TypeDef, FM4_I2SPRE_TypeDef;

