mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/common/s6e2dfxj.h
#define bFM_I2S1_OPRREG_START                     *((volatile  uint8_t *)(0x42D90300UL))
#define bFM4_I2S1_OPRREG_START                    *((volatile  uint8_t *)(0x42D90300UL))
#define bFM_I2S1_OPRREG_TXENB                     *((volatile  uint8_t *)(0x42D90340UL))
#define bFM4_I2S1_OPRREG_TXENB                    *((volatile  uint8_t *)(0x42D90340UL))
#define bFM_I2S1_OPRREG_RXENB                     *((volatile  uint8_t *)(0x42D90360UL))
#define bFM4_I2S1_OPRREG_RXENB                    *((volatile  uint8_t *)(0x42D90360UL))

#define bFM_I2S1_SRST_SRST                        *((volatile  uint8_t *)(0x42D90380UL))
#define bFM4_I2S1_SRST_SRST                       *((volatile  uint8_t *)(0x42D90380UL))

#define bFM_I2S1_STATUS_RXFI                      *((volatile  uint8_t *)(0x42D904C0UL))
#define bFM4_I2S1_STATUS_RXFI                     *((volatile  uint8_t *)(0x42D904C0UL))
#define bFM_I2S1_STATUS_TXFI                      *((volatile  uint8_t *)(0x42D904C4UL))
#define bFM4_I2S1_STATUS_TXFI                     *((volatile  uint8_t *)(0x42D904C4UL))
#define bFM_I2S1_STATUS_BSY                       *((volatile  uint8_t *)(0x42D904C8UL))
#define bFM4_I2S1_STATUS_BSY                      *((volatile  uint8_t *)(0x42D904C8UL))
#define bFM_I2S1_STATUS_EOPI                      *((volatile  uint8_t *)(0x42D904CCUL))
#define bFM4_I2S1_STATUS_EOPI                     *((volatile  uint8_t *)(0x42D904CCUL))
#define bFM_I2S1_STATUS_RXOVR                     *((volatile  uint8_t *)(0x42D904E0UL))
#define bFM4_I2S1_STATUS_RXOVR                    *((volatile  uint8_t *)(0x42D904E0UL))
#define bFM_I2S1_STATUS_RXUDR                     *((volatile  uint8_t *)(0x42D904E4UL))
#define bFM4_I2S1_STATUS_RXUDR                    *((volatile  uint8_t *)(0x42D904E4UL))
#define bFM_I2S1_STATUS_TXOVR                     *((volatile  uint8_t *)(0x42D904E8UL))
#define bFM4_I2S1_STATUS_TXOVR                    *((volatile  uint8_t *)(0x42D904E8UL))
#define bFM_I2S1_STATUS_TXUDR0                    *((volatile  uint8_t *)(0x42D904ECUL))
#define bFM4_I2S1_STATUS_TXUDR0                   *((volatile  uint8_t *)(0x42D904ECUL))
#define bFM_I2S1_STATUS_TXUDR1                    *((volatile  uint8_t *)(0x42D904F0UL))
#define bFM4_I2S1_STATUS_TXUDR1                   *((volatile  uint8_t *)(0x42D904F0UL))
#define bFM_I2S1_STATUS_FERR                      *((volatile  uint8_t *)(0x42D904F4UL))
#define bFM4_I2S1_STATUS_FERR                     *((volatile  uint8_t *)(0x42D904F4UL))
#define bFM_I2S1_STATUS_RBERR                     *((volatile  uint8_t *)(0x42D904F8UL))
#define bFM4_I2S1_STATUS_RBERR                    *((volatile  uint8_t *)(0x42D904F8UL))
#define bFM_I2S1_STATUS_TBERR                     *((volatile  uint8_t *)(0x42D904FCUL))
#define bFM4_I2S1_STATUS_TBERR                    *((volatile  uint8_t *)(0x42D904FCUL))

#define bFM_I2S1_TSTREG_LBMD                      *((volatile  uint8_t *)(0x42D90580UL))
#define bFM4_I2S1_TSTREG_LBMD                     *((volatile  uint8_t *)(0x42D90580UL))


/*******************************************************************************
* I2SPRE Registers I2SPRE
*   Bitband Section
*******************************************************************************/
#define bFM_I2SPRE_ICCR_I2SEN                     *((volatile  uint8_t *)(0x427A0000UL))
#define bFM4_I2SPRE_ICCR_I2SEN                    *((volatile  uint8_t *)(0x427A0000UL))
#define bFM_I2SPRE_ICCR_ICSEL                     *((volatile  uint8_t *)(0x427A0004UL))
#define bFM4_I2SPRE_ICCR_ICSEL                    *((volatile  uint8_t *)(0x427A0004UL))

#define bFM_I2SPRE_ICCR_1_I2SEN1                  *((volatile  uint8_t *)(0x427A0600UL))
#define bFM4_I2SPRE_ICCR_1_I2SEN1                 *((volatile  uint8_t *)(0x427A0600UL))
#define bFM_I2SPRE_ICCR_1_ICSEL1                  *((volatile  uint8_t *)(0x427A0604UL))
#define bFM4_I2SPRE_ICCR_1_ICSEL1                 *((volatile  uint8_t *)(0x427A0604UL))

#define bFM_I2SPRE_IP_STR_IPRDY                   *((volatile  uint8_t *)(0x427A0280UL))
#define bFM4_I2SPRE_IP_STR_IPRDY                  *((volatile  uint8_t *)(0x427A0280UL))

#define bFM_I2SPRE_IPCR1_IPLLEN                   *((volatile  uint8_t *)(0x427A0080UL))
#define bFM4_I2SPRE_IPCR1_IPLLEN                  *((volatile  uint8_t *)(0x427A0080UL))

#define bFM_I2SPRE_IPINT_CLR_IPCSC                *((volatile  uint8_t *)(0x427A0380UL))
#define bFM4_I2SPRE_IPINT_CLR_IPCSC               *((volatile  uint8_t *)(0x427A0380UL))

#define bFM_I2SPRE_IPINT_ENR_IPCSE                *((volatile  uint8_t *)(0x427A0300UL))
#define bFM4_I2SPRE_IPINT_ENR_IPCSE               *((volatile  uint8_t *)(0x427A0300UL))

#define bFM_I2SPRE_IPINT_STR_IPCSI                *((volatile  uint8_t *)(0x427A0400UL))
#define bFM4_I2SPRE_IPINT_STR_IPCSI               *((volatile  uint8_t *)(0x427A0400UL))


/*******************************************************************************
* INTREQ Registers INTREQ
*   Bitband Section
*******************************************************************************/
#define bFM_INTREQ_DRQSEL_USBEP1                  *((volatile  uint8_t *)(0x42620000UL))
#define bFM4_INTREQ_DRQSEL_USBEP1                 *((volatile  uint8_t *)(0x42620000UL))
#define bFM_INTREQ_DRQSEL_USBEP2                  *((volatile  uint8_t *)(0x42620004UL))
#define bFM4_INTREQ_DRQSEL_USBEP2                 *((volatile  uint8_t *)(0x42620004UL))
#define bFM_INTREQ_DRQSEL_USBEP3                  *((volatile  uint8_t *)(0x42620008UL))
#define bFM4_INTREQ_DRQSEL_USBEP3                 *((volatile  uint8_t *)(0x42620008UL))
#define bFM_INTREQ_DRQSEL_USBEP4                  *((volatile  uint8_t *)(0x4262000CUL))
#define bFM4_INTREQ_DRQSEL_USBEP4                 *((volatile  uint8_t *)(0x4262000CUL))
#define bFM_INTREQ_DRQSEL_USBEP5                  *((volatile  uint8_t *)(0x42620010UL))
#define bFM4_INTREQ_DRQSEL_USBEP5                 *((volatile  uint8_t *)(0x42620010UL))
#define bFM_INTREQ_DRQSEL_ADCSCAN0                *((volatile  uint8_t *)(0x42620014UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN0               *((volatile  uint8_t *)(0x42620014UL))
#define bFM_INTREQ_DRQSEL_ADCSCAN1                *((volatile  uint8_t *)(0x42620018UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN1               *((volatile  uint8_t *)(0x42620018UL))
#define bFM_INTREQ_DRQSEL_ADCSCAN2                *((volatile  uint8_t *)(0x4262001CUL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN2               *((volatile  uint8_t *)(0x4262001CUL))
#define bFM_INTREQ_DRQSEL_IRQ0BT0                 *((volatile  uint8_t *)(0x42620020UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT0                *((volatile  uint8_t *)(0x42620020UL))
#define bFM_INTREQ_DRQSEL_IRQ0BT2                 *((volatile  uint8_t *)(0x42620024UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT2                *((volatile  uint8_t *)(0x42620024UL))
#define bFM_INTREQ_DRQSEL_IRQ0BT4                 *((volatile  uint8_t *)(0x42620028UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT4                *((volatile  uint8_t *)(0x42620028UL))
#define bFM_INTREQ_DRQSEL_IRQ0BT6                 *((volatile  uint8_t *)(0x4262002CUL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT6                *((volatile  uint8_t *)(0x4262002CUL))
#define bFM_INTREQ_DRQSEL_MFS0RX                  *((volatile  uint8_t *)(0x42620030UL))
#define bFM4_INTREQ_DRQSEL_MFS0RX                 *((volatile  uint8_t *)(0x42620030UL))
#define bFM_INTREQ_DRQSEL_MFS0TX                  *((volatile  uint8_t *)(0x42620034UL))
#define bFM4_INTREQ_DRQSEL_MFS0TX                 *((volatile  uint8_t *)(0x42620034UL))
#define bFM_INTREQ_DRQSEL_MFS1RX                  *((volatile  uint8_t *)(0x42620038UL))
#define bFM4_INTREQ_DRQSEL_MFS1RX                 *((volatile  uint8_t *)(0x42620038UL))
#define bFM_INTREQ_DRQSEL_MFS1TX                  *((volatile  uint8_t *)(0x4262003CUL))
#define bFM4_INTREQ_DRQSEL_MFS1TX                 *((volatile  uint8_t *)(0x4262003CUL))
#define bFM_INTREQ_DRQSEL_MFS2RX                  *((volatile  uint8_t *)(0x42620040UL))
#define bFM4_INTREQ_DRQSEL_MFS2RX                 *((volatile  uint8_t *)(0x42620040UL))
#define bFM_INTREQ_DRQSEL_MFS2TX                  *((volatile  uint8_t *)(0x42620044UL))
#define bFM4_INTREQ_DRQSEL_MFS2TX                 *((volatile  uint8_t *)(0x42620044UL))
#define bFM_INTREQ_DRQSEL_MFS3RX                  *((volatile  uint8_t *)(0x42620048UL))
#define bFM4_INTREQ_DRQSEL_MFS3RX                 *((volatile  uint8_t *)(0x42620048UL))
#define bFM_INTREQ_DRQSEL_MFS3TX                  *((volatile  uint8_t *)(0x4262004CUL))
#define bFM4_INTREQ_DRQSEL_MFS3TX                 *((volatile  uint8_t *)(0x4262004CUL))
#define bFM_INTREQ_DRQSEL_MFS4RX                  *((volatile  uint8_t *)(0x42620050UL))
#define bFM4_INTREQ_DRQSEL_MFS4RX                 *((volatile  uint8_t *)(0x42620050UL))
#define bFM_INTREQ_DRQSEL_MFS4TX                  *((volatile  uint8_t *)(0x42620054UL))
#define bFM4_INTREQ_DRQSEL_MFS4TX                 *((volatile  uint8_t *)(0x42620054UL))
#define bFM_INTREQ_DRQSEL_MFS5RX                  *((volatile  uint8_t *)(0x42620058UL))
#define bFM4_INTREQ_DRQSEL_MFS5RX                 *((volatile  uint8_t *)(0x42620058UL))
#define bFM_INTREQ_DRQSEL_MFS5TX                  *((volatile  uint8_t *)(0x4262005CUL))
#define bFM4_INTREQ_DRQSEL_MFS5TX                 *((volatile  uint8_t *)(0x4262005CUL))
#define bFM_INTREQ_DRQSEL_MFS6RX                  *((volatile  uint8_t *)(0x42620060UL))
#define bFM4_INTREQ_DRQSEL_MFS6RX                 *((volatile  uint8_t *)(0x42620060UL))
#define bFM_INTREQ_DRQSEL_MFS6TX                  *((volatile  uint8_t *)(0x42620064UL))
#define bFM4_INTREQ_DRQSEL_MFS6TX                 *((volatile  uint8_t *)(0x42620064UL))
#define bFM_INTREQ_DRQSEL_MFS7RX                  *((volatile  uint8_t *)(0x42620068UL))
#define bFM4_INTREQ_DRQSEL_MFS7RX                 *((volatile  uint8_t *)(0x42620068UL))
#define bFM_INTREQ_DRQSEL_MFS7TX                  *((volatile  uint8_t *)(0x4262006CUL))
#define bFM4_INTREQ_DRQSEL_MFS7TX                 *((volatile  uint8_t *)(0x4262006CUL))
#define bFM_INTREQ_DRQSEL_EXINT0                  *((volatile  uint8_t *)(0x42620070UL))
#define bFM4_INTREQ_DRQSEL_EXINT0                 *((volatile  uint8_t *)(0x42620070UL))
#define bFM_INTREQ_DRQSEL_EXINT1                  *((volatile  uint8_t *)(0x42620074UL))
#define bFM4_INTREQ_DRQSEL_EXINT1                 *((volatile  uint8_t *)(0x42620074UL))
#define bFM_INTREQ_DRQSEL_EXINT2                  *((volatile  uint8_t *)(0x42620078UL))
#define bFM4_INTREQ_DRQSEL_EXINT2                 *((volatile  uint8_t *)(0x42620078UL))
#define bFM_INTREQ_DRQSEL_EXINT3                  *((volatile  uint8_t *)(0x4262007CUL))
#define bFM4_INTREQ_DRQSEL_EXINT3                 *((volatile  uint8_t *)(0x4262007CUL))

