mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/common/s6e2dfxj.h
#define bFM_SDIF_SNINTST_CMDCMPLT                 *((volatile  uint8_t *)(0x42DC0600UL))
#define bFM4_SDIF_SNINTST_CMDCMPLT                *((volatile  uint8_t *)(0x42DC0600UL))
#define bFM_SDIF_SNINTST_TRSFCMPLT                *((volatile  uint8_t *)(0x42DC0604UL))
#define bFM4_SDIF_SNINTST_TRSFCMPLT               *((volatile  uint8_t *)(0x42DC0604UL))
#define bFM_SDIF_SNINTST_BLCKGEVNT                *((volatile  uint8_t *)(0x42DC0608UL))
#define bFM4_SDIF_SNINTST_BLCKGEVNT               *((volatile  uint8_t *)(0x42DC0608UL))
#define bFM_SDIF_SNINTST_DMAINT                   *((volatile  uint8_t *)(0x42DC060CUL))
#define bFM4_SDIF_SNINTST_DMAINT                  *((volatile  uint8_t *)(0x42DC060CUL))
#define bFM_SDIF_SNINTST_BUFWRRDY                 *((volatile  uint8_t *)(0x42DC0610UL))
#define bFM4_SDIF_SNINTST_BUFWRRDY                *((volatile  uint8_t *)(0x42DC0610UL))
#define bFM_SDIF_SNINTST_BUFRDRDY                 *((volatile  uint8_t *)(0x42DC0614UL))
#define bFM4_SDIF_SNINTST_BUFRDRDY                *((volatile  uint8_t *)(0x42DC0614UL))
#define bFM_SDIF_SNINTST_CARDINS                  *((volatile  uint8_t *)(0x42DC0618UL))
#define bFM4_SDIF_SNINTST_CARDINS                 *((volatile  uint8_t *)(0x42DC0618UL))
#define bFM_SDIF_SNINTST_CARDRMV                  *((volatile  uint8_t *)(0x42DC061CUL))
#define bFM4_SDIF_SNINTST_CARDRMV                 *((volatile  uint8_t *)(0x42DC061CUL))
#define bFM_SDIF_SNINTST_CARDINT                  *((volatile  uint8_t *)(0x42DC0620UL))
#define bFM4_SDIF_SNINTST_CARDINT                 *((volatile  uint8_t *)(0x42DC0620UL))
#define bFM_SDIF_SNINTST_INT_A                    *((volatile  uint8_t *)(0x42DC0624UL))
#define bFM4_SDIF_SNINTST_INT_A                   *((volatile  uint8_t *)(0x42DC0624UL))
#define bFM_SDIF_SNINTST_INT_B                    *((volatile  uint8_t *)(0x42DC0628UL))
#define bFM4_SDIF_SNINTST_INT_B                   *((volatile  uint8_t *)(0x42DC0628UL))
#define bFM_SDIF_SNINTST_INT_C                    *((volatile  uint8_t *)(0x42DC062CUL))
#define bFM4_SDIF_SNINTST_INT_C                   *((volatile  uint8_t *)(0x42DC062CUL))
#define bFM_SDIF_SNINTST_RETUNEEVT                *((volatile  uint8_t *)(0x42DC0630UL))
#define bFM4_SDIF_SNINTST_RETUNEEVT               *((volatile  uint8_t *)(0x42DC0630UL))
#define bFM_SDIF_SNINTST_ERRORINT                 *((volatile  uint8_t *)(0x42DC063CUL))
#define bFM4_SDIF_SNINTST_ERRORINT                *((volatile  uint8_t *)(0x42DC063CUL))

#define bFM_SDIF_SNINTSTE_CMDCMPLTS               *((volatile  uint8_t *)(0x42DC0680UL))
#define bFM4_SDIF_SNINTSTE_CMDCMPLTS              *((volatile  uint8_t *)(0x42DC0680UL))
#define bFM_SDIF_SNINTSTE_TRSFCMPLTS              *((volatile  uint8_t *)(0x42DC0684UL))
#define bFM4_SDIF_SNINTSTE_TRSFCMPLTS             *((volatile  uint8_t *)(0x42DC0684UL))
#define bFM_SDIF_SNINTSTE_BLCKGEVNTS              *((volatile  uint8_t *)(0x42DC0688UL))
#define bFM4_SDIF_SNINTSTE_BLCKGEVNTS             *((volatile  uint8_t *)(0x42DC0688UL))
#define bFM_SDIF_SNINTSTE_DMAINTS                 *((volatile  uint8_t *)(0x42DC068CUL))
#define bFM4_SDIF_SNINTSTE_DMAINTS                *((volatile  uint8_t *)(0x42DC068CUL))
#define bFM_SDIF_SNINTSTE_BUFWRRDYS               *((volatile  uint8_t *)(0x42DC0690UL))
#define bFM4_SDIF_SNINTSTE_BUFWRRDYS              *((volatile  uint8_t *)(0x42DC0690UL))
#define bFM_SDIF_SNINTSTE_BUFRDRDYS               *((volatile  uint8_t *)(0x42DC0694UL))
#define bFM4_SDIF_SNINTSTE_BUFRDRDYS              *((volatile  uint8_t *)(0x42DC0694UL))
#define bFM_SDIF_SNINTSTE_CARDINSS                *((volatile  uint8_t *)(0x42DC0698UL))
#define bFM4_SDIF_SNINTSTE_CARDINSS               *((volatile  uint8_t *)(0x42DC0698UL))
#define bFM_SDIF_SNINTSTE_CARDRMVS                *((volatile  uint8_t *)(0x42DC069CUL))
#define bFM4_SDIF_SNINTSTE_CARDRMVS               *((volatile  uint8_t *)(0x42DC069CUL))
#define bFM_SDIF_SNINTSTE_CARDINTS                *((volatile  uint8_t *)(0x42DC06A0UL))
#define bFM4_SDIF_SNINTSTE_CARDINTS               *((volatile  uint8_t *)(0x42DC06A0UL))
#define bFM_SDIF_SNINTSTE_INT_AS                  *((volatile  uint8_t *)(0x42DC06A4UL))
#define bFM4_SDIF_SNINTSTE_INT_AS                 *((volatile  uint8_t *)(0x42DC06A4UL))
#define bFM_SDIF_SNINTSTE_INT_BS                  *((volatile  uint8_t *)(0x42DC06A8UL))
#define bFM4_SDIF_SNINTSTE_INT_BS                 *((volatile  uint8_t *)(0x42DC06A8UL))
#define bFM_SDIF_SNINTSTE_INT_CS                  *((volatile  uint8_t *)(0x42DC06ACUL))
#define bFM4_SDIF_SNINTSTE_INT_CS                 *((volatile  uint8_t *)(0x42DC06ACUL))
#define bFM_SDIF_SNINTSTE_RETUNEEVTS              *((volatile  uint8_t *)(0x42DC06B0UL))
#define bFM4_SDIF_SNINTSTE_RETUNEEVTS             *((volatile  uint8_t *)(0x42DC06B0UL))

#define bFM_SDIF_SPRSTAT_CMDINH                   *((volatile  uint8_t *)(0x42DC0480UL))
#define bFM4_SDIF_SPRSTAT_CMDINH                  *((volatile  uint8_t *)(0x42DC0480UL))
#define bFM_SDIF_SPRSTAT_CMDDATINH                *((volatile  uint8_t *)(0x42DC0484UL))
#define bFM4_SDIF_SPRSTAT_CMDDATINH               *((volatile  uint8_t *)(0x42DC0484UL))
#define bFM_SDIF_SPRSTAT_DATLNACT                 *((volatile  uint8_t *)(0x42DC0488UL))
#define bFM4_SDIF_SPRSTAT_DATLNACT                *((volatile  uint8_t *)(0x42DC0488UL))
#define bFM_SDIF_SPRSTAT_RETUNEREQ                *((volatile  uint8_t *)(0x42DC048CUL))
#define bFM4_SDIF_SPRSTAT_RETUNEREQ               *((volatile  uint8_t *)(0x42DC048CUL))
#define bFM_SDIF_SPRSTAT_WRTRSFACT                *((volatile  uint8_t *)(0x42DC04A0UL))
#define bFM4_SDIF_SPRSTAT_WRTRSFACT               *((volatile  uint8_t *)(0x42DC04A0UL))
#define bFM_SDIF_SPRSTAT_RDTRSFACT                *((volatile  uint8_t *)(0x42DC04A4UL))
#define bFM4_SDIF_SPRSTAT_RDTRSFACT               *((volatile  uint8_t *)(0x42DC04A4UL))
#define bFM_SDIF_SPRSTAT_BUFWREN                  *((volatile  uint8_t *)(0x42DC04A8UL))
#define bFM4_SDIF_SPRSTAT_BUFWREN                 *((volatile  uint8_t *)(0x42DC04A8UL))
#define bFM_SDIF_SPRSTAT_BUFRDEN                  *((volatile  uint8_t *)(0x42DC04ACUL))
#define bFM4_SDIF_SPRSTAT_BUFRDEN                 *((volatile  uint8_t *)(0x42DC04ACUL))
#define bFM_SDIF_SPRSTAT_CARDINS                  *((volatile  uint8_t *)(0x42DC04C0UL))
#define bFM4_SDIF_SPRSTAT_CARDINS                 *((volatile  uint8_t *)(0x42DC04C0UL))
#define bFM_SDIF_SPRSTAT_CARDSTB                  *((volatile  uint8_t *)(0x42DC04C4UL))
#define bFM4_SDIF_SPRSTAT_CARDSTB                 *((volatile  uint8_t *)(0x42DC04C4UL))
#define bFM_SDIF_SPRSTAT_CARDDET                  *((volatile  uint8_t *)(0x42DC04C8UL))
#define bFM4_SDIF_SPRSTAT_CARDDET                 *((volatile  uint8_t *)(0x42DC04C8UL))
#define bFM_SDIF_SPRSTAT_WPPINLVL                 *((volatile  uint8_t *)(0x42DC04CCUL))
#define bFM4_SDIF_SPRSTAT_WPPINLVL                *((volatile  uint8_t *)(0x42DC04CCUL))
#define bFM_SDIF_SPRSTAT_CMDLNSGN                 *((volatile  uint8_t *)(0x42DC04E0UL))
#define bFM4_SDIF_SPRSTAT_CMDLNSGN                *((volatile  uint8_t *)(0x42DC04E0UL))

#define bFM_SDIF_SPRVAL0_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0C28UL))
#define bFM4_SDIF_SPRVAL0_CGSELVAL                *((volatile  uint8_t *)(0x42DC0C28UL))

#define bFM_SDIF_SPRVAL1_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0C68UL))
#define bFM4_SDIF_SPRVAL1_CGSELVAL                *((volatile  uint8_t *)(0x42DC0C68UL))

#define bFM_SDIF_SPRVAL2_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0CA8UL))
#define bFM4_SDIF_SPRVAL2_CGSELVAL                *((volatile  uint8_t *)(0x42DC0CA8UL))

#define bFM_SDIF_SPRVAL3_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0CE8UL))
#define bFM4_SDIF_SPRVAL3_CGSELVAL                *((volatile  uint8_t *)(0x42DC0CE8UL))

#define bFM_SDIF_SPRVAL4_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0D28UL))
#define bFM4_SDIF_SPRVAL4_CGSELVAL                *((volatile  uint8_t *)(0x42DC0D28UL))

#define bFM_SDIF_SPRVAL5_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0D68UL))
#define bFM4_SDIF_SPRVAL5_CGSELVAL                *((volatile  uint8_t *)(0x42DC0D68UL))

